# HRUSHI WALKE

In [3]:
import pandas as pd

In [5]:
dataset=pd.read_excel("3 aattrition data.xlsx",sheet_name=0)

In [6]:
dataset.head()

,ID,Gender,Birth Date,Education,JobCategory,CurrentSalary,After6Months,SalBegin,Job Time,Prev Exep,Minority
0,3,f,07/26/1929,12,1,21450,16725.0,12000,98,381,0
1,4,f,04/15/1947,8,1,21900,17550.0,13200,98,190,0
2,8,f,1966-06-05 00:00:00,12,1,21900,15825.0,9750,98,0,0
3,9,f,01/23/1946,15,1,27900,20325.0,12750,98,115,0
4,10,f,02/13/1946,12,1,24000,18750.0,13500,98,244,0

In [8]:
from scipy.stats import wilcoxon

In [9]:
stats,p=wilcoxon(dataset.CurrentSalary
,dataset.After6Months )

In [10]:
print(stats,p)

0.0 2.2184966882780807e-79

In [11]:
#here p value is less than 0.05 neglect null hypothesis

In [12]:
from scipy.stats import friedmanchisquare

In [13]:
stats,p=friedmanchisquare(dataset.CurrentSalary,dataset.After6Months,dataset.SalBegin)

In [14]:
print (stats,p)

947.9999999999991 1.3944905574380424e-206

In [15]:
# here p value is less than 0.05 hence we can neglect the null hypothesis.

In [ ]:
#Mann Whitney test

In [20]:
from scipy.stats import mannwhitneyu

In [24]:
dataset=pd.read_excel("3 Mann Whitney.xlsx",sheet_name=1)

In [25]:
dataset.head()

   Design1  Design2
0       11       12
1       17       10
2       16       15
3       14       19
4       15       11

In [27]:
stats,p=mannwhitneyu(dataset.Design1,dataset.Design2)

In [28]:
print(stats,p)

9.0 0.2641796636354743

In [29]:
#here p value is greater than 0.05 hence we can accept null hypothesis.

In [30]:
dataset3=pd.read_excel("4 Kruskal Wallis.xlsx",sheet_name=0)

In [31]:
from scipy.stats import kruskal

In [33]:
dataset3.head()

   Design1  Design2  Design3  Showroom
0       11       12       23         1
1       17       10       20         2
2       16       15       18         3
3       14       19       17         4
4       15       11       10         5

In [35]:
stats,p=kruskal(dataset3.Design1,dataset3.Design2,dataset3.Design3)

In [36]:
print(stats,p)

2.7345323741007226 0.25480259087913626

In [37]:
#here the p value is greater than so we can accept null hypothesis.

#Chi square test

In [48]:
dataset4= pd.read_excel("5 Chi square Test.xlsx",sheet_name=0)

In [50]:
from scipy.stats import chi2_contingency

In [51]:
dataset4.head()

     ids  Gender        Smoking
0  43783  Female      NonSmoker
1  20278  Female      NonSmoker
2  20389  Female      NonSmoker
3  22820    Male            NaN
4  24559    Male  CurrentSmoker

In [53]:
stats,p,dof,expeted=chi2_contingency(dataset4)

TypeError: '<' not supported between instances of 'str' and 'int'

In [54]:
dataset5=pd.read_excel("3 aattrition data.xlsx",sheet_name=0)

In [55]:
from scipy.stats import ttest_1samp

In [56]:
dataset5.head()

,ID,Gender,Birth Date,Education,JobCategory,CurrentSalary,After6Months,SalBegin,Job Time,Prev Exep,Minority
0,3,f,07/26/1929,12,1,21450,16725.0,12000,98,381,0
1,4,f,04/15/1947,8,1,21900,17550.0,13200,98,190,0
2,8,f,1966-06-05 00:00:00,12,1,21900,15825.0,9750,98,0,0
3,9,f,01/23/1946,15,1,27900,20325.0,12750,98,115,0
4,10,f,02/13/1946,12,1,24000,18750.0,13500,98,244,0

In [59]:
stats,p=ttest_1samp(dataset5.Education,15)

In [60]:
print(stats,p)

-11.383981347148241 1.0552152582606838e-26

In [61]:
#here p value is less than 00.05 accepting the alternative hypothesis

In [62]:
from scipy.stats import ttest_rel

In [64]:
stats,p=ttest_rel(dataset5.CurrentSalary,dataset5.SalBegin)

In [65]:
print(stats,p)

35.03596083911304 1.610162748582498e-133

#here p value is less than 0.05 hence we can conclude 
that there is significant difference between current salary and begining salary.

In [68]:
dataset5.head()

,ID,Gender,Birth Date,Education,JobCategory,CurrentSalary,After6Months,SalBegin,Job Time,Prev Exep,Minority
0,3,f,07/26/1929,12,1,21450,16725.0,12000,98,381,0
1,4,f,04/15/1947,8,1,21900,17550.0,13200,98,190,0
2,8,f,1966-06-05 00:00:00,12,1,21900,15825.0,9750,98,0,0
3,9,f,01/23/1946,15,1,27900,20325.0,12750,98,115,0
4,10,f,02/13/1946,12,1,24000,18750.0,13500,98,244,0

In [69]:
from scipy.stats import ttest_ind

In [75]:
stats,p=ttest_ind(dataset5.Education,dataset5.SalBegin)

In [76]:
print(stats,p)

-47.0321035741297 7.317257221943578e-250

In [77]:
#here value is less than 0.05 so we can reject the null hypothesis.
#it concludes that there is significant difference in education and salary at begining

one way annova